{
  "homepage": "https://www.curseforge.com/minecraft/mc-mods/ambience-extras/files",
   "1.15.2": {
    "1.0.7.4": "BUGFIX - Fixed a bug in the Ocarina when it breaks it was causing the game to crash.",
    "1.0.7.3": ""NEW FEATURE - Added the event.ridding.[entityname]\nNEW FEATURE - Added the event.advancements.\nNEW FEATURE - Added the event.loadingWorld.\nNEW FEATURE - Added an option to configure the distance in blocks between the player and hostile mobs to determine if still in combat or not.\nCHANGE - Reduced the time that the cinematic screen is shown on screen by half",
    "1.0.7.2": "NEW FEATURE - Added events for potions effects!\nCHANGE - The volume for the cinematic transtion is now lower.\nBUGFIX - The structure event wasn't sttoping playing if you leave the sctructure in a multiplayer game with more than 1 people playing.\nBUGFIX - The horde music was conflicting with the battle music.\nBUGFIX - The mod wasn't working if you didn't have the ambience resource pack enabled, now it's working fine without the resource pack.",
    "1.0.7" : "NEW FEATURE - Added cinematic transitions when entering structures or custom created regions (download the lastest version of the Resource Pack to enable it).\nNEW FEATURE - Added events for structures\nNEW FEATURE - Added an option to fade out the game volume when the window is not on focus",
    "1.0.6.1" : "NEW FEATURE: Added a config to control the fade in/out duration in the config file.\nNEW FEATURE: Added commands to create/list/showInfo/edit/remove areas.\nCHANGED: Now the ocarina damages only after playing a song.\nCHANGED: Now the ocarina consumes a little bit of xp when played a song\nBUGFIX: Fixed a bug on the ocarina if there isn't any song configured in the ambience.properties file\nBUGFIX: Fixed the ocarina texture UV\nBUGFIX: Sometimes the opacity for the ocarina playing effect were opaque, now its working properly.",
    "1.0.6" : "NEW ITEM: added The Horn from the Gods.\nNEW ITEM: added a magic Ocarina.\nNEW FEATURE: made the background music play the Silent Event if you insert a disc into a juckebox and are less than 50 blocks of distance (works right only if you are interacting with one juckebox at a time).\nNEW FEATURE: added the Ranch event.\nNEW FEATURE: added the Sun's Song to the ocarina (turns night to day and vice-versa).\nNEW FEATURE: added the Song of Storms to the ocarina (turns the weather to thunder and vice-versa).\nNEW FEATURE: added the Bolero of Fire to the ocarina (gives protection against fire to the player).\nNEW FEATURE: added the Horse Song to the ocarina (calls your horse if he is far from you , range: 128 blocks).\nNEW FEATURE: added the Serenade of Water to the ocarina (gives you water breathing).\nNEW FEATURE: added the Prelude of Light to the ocarina (gives you night vision).\nNEW FEATURE: added the Minuet of Forest to the ocarina (heals the player).\nNEW FEATURE: added a config file to disable the effects from the new ocarina item.\nNEW FEATURE: added Shortcuts to play musics locally or for all players if sneaking (and if you are a server admin).\nBUGFIX: fixed a bug where the sound being played by the Speaker and the Alarm aren't stopping immediately after turning off the redstone signal.\nBUGFIX: fixed a bug where the selected area wasn't beeing synced correctly with the server.\nBUGFIX: fixed a bug where the rain sound was stopping playing if the player were under a block.\nBUGFIX: fixed a bug in the Song Switcher block where it weren't getting the redstone signal on placement inside a region.\nBUGFIX: fixed the facing direction for the Song Switcher block.",
    "1.0.5.1" : "NEW FEATURE - Added sound effects for dripping water and lava to the mod.\nCHANGE - The horde music will only play now if you hit or get attacked by a mob where there are 5 or more hostiles mobs nearby\nBUGFIX - The name returned from the mobs from the boss mobs here returning wrong, now it is ignoring the modid and getting only the name.\nBUGFIX - Mobs with spaces in the name, weren't being mapped correctly.",
    "1.0.5" : "BUG FIX - Fixed a bug that causes the game to crash when you break a Song Switcher\nNEW FEATURE - Updated the API for other modders add their own custom events to the Ambience -  Extras mod",	   
    "1.0.4.2" : "BUGFIX - Fixed a crash when inside caves with lava",
    "1.0.4.1" : "BUGFIX - Fixed a crash when you enter a world and was not possible to create some water particles",
    "1.0.4" : "New Block - The Song Switcher added, it changes the music that is playing in a region depending on the intensity of the redstone signal. (it's perfect when creating minigames)\nNew Feature - Added an event to detect dripping water on water inside caves.\nNew Feature - Added sound effects for water and lava dripping for more immerssion.\nCHANGE - Changed the SoundCategory for the speaker and the alarm blocks from NEUTRAL to BLOCKS so you can adjust the volume for these blocks in the sound options.",
    "1.0.3" : "BUGFIX - Fixed keyboard events not triggering events to reload the configs or force play\nBUGFIX - Fixed sync between clients on selected regions\nBUGFIX - Fixed sync between clients on alarms and speakers settings\nBUGFIX - Fixed alarm not playing\nBUGFIX - Fixed alarm and speaker not stopping the sound immediately after turn off redstone\nBUGFIX - Fixed the alarm and speaker not dropping itself when broken\nCHANGE - Added the list of areas in the create/edit regions screen",
    "1.0.2" : "BUGFIX - Not able to create or edit regions on Server.s\nChange - Added the button to delete regions.",
    "1.0.1" : "BUGFIX - The speaker wasn't getting the lenght of the playing sound causing it to overlap the audio\nBUGFIX - The selected Area weren't beeing created, now its working for creation and edit\nCHANGE - Added the Show Selected Area button in the edit Area Screen",
    "1.0.0" : "Migrated to the 1.15.2 version!!!"
  },
   "1.12.2": {
    "1.4.3": "CHANGE - The mobs from mowzie's mobs were hard codded to always play the BOSS event music, now it's respecting the settings from the ambience.properties file\nBUGFIX- Some times if you go to fast over biomes the audio fade out and won't fade in again, now it's working fine.",
	"1.4.4": "BUGFIX - Changed the way the reset key works when reloading the ambience.properties file in game\nBUGFIX - Alarm dropping always the white color when broken by the player after as received a redstone signal at least one time.",
  	"1.4.4.1": "BUGFIX - Added the notification config to the ambience.properties file if the player don't have it added.",
	"1.4.5": "NEW - Added configurations to set the events per Dimension!!!\nNew - Added events to when you pause the game, when sleeping, connecting or disconnecting from a server, falling, flying with Elytra, on lava and when you dies.\nCHANGED - Event name for the ender dragon from 'bossDragon' to 'bossEnderDragon'",
  	"1.4.5.1": "BUGFIX - Certain mobs from other mods when you hit they the game freezes when loading the combat music, now it's working fine.",
  	"1.4.5.2": "CHANGE - Changed the way the mod detects when is in combat or not, to a more effective way.\nCHANGE - When you are using a mod that changes the main menu and it has it own theme music it will play the music defined by the mod if you comment the event.mainMenu in the config files.",
	"1.4.5.3": "BUGFIX -  Fixed a bug where the sounds of the game get muted in other dimensions\nCHANGE - Changed the rendering of the Selected Area with the Soundnizer tool to somehow render something with shaders.",
  	"1.4.6": "CHANGE - Added the list of areas in the create/edit regions screen",
    "1.5.0": "NEW FEATURE - Added the Song Switcher from the 1.15.2 into this version.\nNEW FEATURE - Added sound effects for dripping water and lava to the mod.\nCHANGE - Fixed the old API to follow the new rules from the wiki.\nCHANGE - The horde music will only play now if you hit or get attacked by a mob where there are 5 or more hostiles mobs nearby.\nBUGFIX - The name returned from the mobs from the Mowzies mobs here returning wrong, they where returning like mowziesmobs:ferrous_wroughtnaut so the events wouldn't work if you put [mob.ferrous_wroughtnaut] now it will work.\nBUGFIX - Mobs with spaces in the name weren't being mapped correctly.",
    "1.6.0": "NEW ITEM - added The Horn from the Gods.\nNEW ITEM: added a magic Ocarina.\nNEW FEATURE: made the background music play the Silent Event if you insert a disc into a juckebox and are less than 50 blocks of distance (works right only if you are interacting with one juckebox at a time).\nNEW FEATURE: added the Ranch event.\nNEW FEATURE: added the Sun's Song to the ocarina (turns night to day and vice-versa).\nNEW FEATURE: added the Song of Storms to the ocarina (turns the weather to thunder and vice-versa).\nNEW FEATURE: added the Bolero of Fire to the ocarina (gives protection against fire to the player).\nNEW FEATURE: added the Horse Song to the ocarina (calls your horse if he is far from you , range: 128 blocks).\nNEW FEATURE: added the Serenade of Water to the ocarina (gives you water breathing).\nNEW FEATURE: added the Prelude of Light to the ocarina (gives you night vision).\nNEW FEATURE: added the Minuet of Forest to the ocarina (heals the player).\nNEW FEATURE: added a config file to disable the effects from the new ocarina item.\nNEW FEATURE: added Shortcuts to play musics locally or for all players if holding CTRL (and if you are a server admin).\nBUGFIX: fixed a bug where the rain sound was stopping playing if the player were under a block.\n.BUGFIX: fixed a bug related to the water and lava dripping sound fx crashing the game.",
	"1.6.1": "NEW FEATURE: Added a config to control the fade in/out duration in the config file.\nNEW FEATURE: Added commands to create/list/showInfo/edit/remove areas.\nCHANGED: Now the ocarina damages only after playing a song.\nCHANGED: Now the ocarina consumes a little bit of xp when played a song\nBUGFIX: Fixed a bug on the ocarina if there isn't any song configured in the ambience.properties file\nBUGFIX: Fixed the ocarina texture UV\nBUGFIX: Sometimes the opacity for the ocarina playing effect were opaque, now its working properly.",
	"1.7.0": "NEW FEATURE - Added cinematic transitions when entering structures or custom created regions (download the lastest version of the Resource Pack to enable it).\nNEW FEATURE - Added events for structures\nNEW FEATURE - Added an option to fade out the game volume when the window is not on focus",
	"1.7.2": "NEW FEATURE - Added events for potions effects!\nCHANGE - The volume for the cinematic transtion is now lower.\nBUGFIX - The structure event wasn't sttoping playing if you leave the sctructure in a multiplayer game with more than 1 people playing.\nBUGFIX - The horde music was conflicting with the battle music.\nBUGFIX - The mod wasn't working if you didn't have the ambience resource pack enabled, now it's working fine without the resource pack.",
	"1.7.3": "NEW FEATURE - Added the event.ridding.[entityname]\nNEW FEATURE - Added the event.advancements.\nNEW FEATURE - Added the event.loadingWorld.\nNEW FEATURE - Added an option to configure the distance in blocks between the player and hostile mobs to determine if still in combat or not.\nCHANGE - Reduced the time that the cinematic screen is shown on screen by half",
	"1.7.4": "BUGFIX - Fixed a bug where the speaker and the alarm weren't stopping playing immediately after turnning redstone off, got exploded or broken",
	"1.7.5": "BUGFIX - Fixed a bug in the ambience configs file",
	"1.7.6": "BUGFIX - Fixed a bug in the Ocarina when it breaks it was causing the game to crash.",
	"1.7.7": "BUGFIX - Fixed a bug in the horn weren't working.\nBUGFIX - Fixed a bug in ocarina that where preventing it to recognize songs.",
	"1.7.8": "BUGFIX - Fixed a bug in the Horn where it wasn't working properly in multiplayer".
   },
  "promos": {
    "1.15.2-latest": "1.0.7.4",
    "1.15.2-recommended": "1.0.7.4",
    "1.12.2-latest": "1.7.8",
    "1.12.2-recommended": "1.7.8"  
  }
}
