{
  "homepage": "https://www.curseforge.com/minecraft/mc-mods/ambience-extras/files",
   "1.15.2": {    
    "1.0.2" : "BUGFIX - Not able to create or edit Areas on Servers\nChange - Added the button to delete areas",
    "1.0.1" : "BUGFIX - The speaker wasn't getting the lenght of the playing sound causing it to overlap the audio\nBUGFIX - The selected Area weren't beeing created, now its working for creation and edit\nCHANGE - Added the Show Selected Area button in the edit Area Screen",
    "1.0.0" : "Migrated to the 1.15.2 version!!!"
  },
   "1.12.2": {
    "1.4.5.3": "BUGFIX -  Fixed a bug where the sounds of the game get muted in other dimensions\nCHANGE - Changed the rendering of the Selected Area with the Soundnizer tool to somehow render something with shaders.",
	"1.4.5.2": "CHANGE - Changed the way the mod detects when is in combat or not, to a more effective way.\nCHANGE - When you are using a mod that changes the main menu and it has it own theme music it will play the music defined by the mod if you comment the event.mainMenu in the config files.",
	"1.4.5.1": "BUGFIX - Certain mobs from other mods when you hit they the game freezes when loading the combat music, now it's working fine.",
	"1.4.5": "NEW - Added configurations to set the events per Dimension!!!\nNew - Added events to when you pause the game, when sleeping, connecting or disconnecting from a server, falling, flying with Elytra, on lava and when you dies.\nCHANGED - Event name for the ender dragon from 'bossDragon' to 'bossEnderDragon'",
	"1.4.4.1": "BUGFIX - Added the notification config to the ambience.properties file if the player don't have it added.",
	"1.4.4": "BUGFIX - Changed the way the reset key works when reloading the ambience.properties file in game\nBUGFIX - Alarm dropping always the white color when broken by the player after as received a redstone signal at least one time.",
    "1.4.3": "CHANGE - The mobs from mowzie's mobs were hard codded to always play the BOSS event music, now it's respecting the settings from the ambience.properties file\nBUGFIX- Some times if you go to fast over biomes the audio fade out and won't fade in again, now it's working fine."
  },
  "promos": {
    "1.15.2": "1.0.1",
    "1.15.2-recommended": "1.0.1",
    "1.12.2-latest": "1.4.5.3",
    "1.12.2-recommended": "1.4.5.3"  
  }
}
